{
  "tcpPort": "ACC clients will use this port to establish a connection to the server",
  "udpPort": "Connected clients will use this Port to stream the car positions and is used for the ping test. In case you never see your server getting a ping value, this indicates that the udpPort is not accessible",
  "registerToLobby": "When 0, this server won’t register to the backend. Is useful for LAN \nsessions. If 0, the server is declared <a href=\"https://www.assettocorsa.net/forum/index.php?threads/the-server-admin-handbook-thread.58245/\">“Private Multiplayer”.</a>",
  "maxClients": "The maximum amount of connections a server will accept at a time. If you own the hardware server, you can just set any high number you want. If you rented a 16 or 24 slot server, your Hosting Provider probably has set this here and doesn’t give you write-access to this configuration file",
  "serverName": "The server name displayed in the ACC UI pages",
  "adminPassword": "Password to elevate via “Server admin commands”",
  "trackMedalsRequirement": "Defines the amount of track medals that a user has to have for the given track (values 0, 1, 2, 3)",
  "safetyRatingRequirement": "Defines the Safety Rating (SA) that a user must have to join this server (values -1, 0, …. 99)",
  "racecraftRatingRequirement": "Defines the Safety Rating (RC) that a user must have to join this \nserver (values -1, 0, …. 99)",
  "password": "Password required to enter this server. If a password is set, the server is declared <a href=\"https://www.assettocorsa.net/forum/index.php?threads/the-server-admin-handbook-thread.58245/\">“Private Multiplayer”.</a>",
  "spectatorSlots": "Defines the amount of spectators that may join this server without owning a car; see <a href=\"https://www.assettocorsa.net/forum/index.php?threads/the-server-admin-handbook-thread.58245/\">“About Spectators”</a>",
  "spectatorPassword": "Password to enter the server as spectator. Must be different to “password” if both is set.",
  "maxClientsOverride": "Possibility to override the “maxClients” value in the <a href=\"https://www.assettocorsa.net/forum/index.php?threads/the-server-admin-handbook-thread.58245/\">“configuration.json”</a>. Can only reduce that value. Use it if you e.g. rented a 24 slot server, but want to restrict it for some reason. Defaults to 30.",
  "dumpLeaderboards": "If set to 1, any session will write down the result leaderboard in a “results” folder (must be manually created). See <a href=\"https://www.assettocorsa.net/forum/index.php?threads/the-server-admin-handbook-thread.58245/\">”Session results”</a>",
  "isRaceLocked": "If set to 0, the server will allow joining during a race session. Is not useful in <a href=\"https://www.assettocorsa.net/forum/index.php?threads/the-server-admin-handbook-thread.58245/\">“Public Multiplayer”</a>, as the user-server matching will ignore ongoing race sessions.",
  "randomizeTrackWhenEmpty": "If set to 1, the server will change to a random track when the \nlast drivers leaves (which causes a reset to FP1). The “track” property will only define the default state for the first session.",
  "centralEntryListPath": "Can override the default entryList path “cfg/entrylist.json”, so multiple ACC servers on the machine can use the same entrylist (and custom car files). Set a full path like “C:/customEntryListSeriesA/”, where the entrylist is stored. \nAttention: The path seperators have to be slashes (/), backslashes (\\) will not work. \n<hr/>\n<a name=5></a>",
  "allowAutoDQ": "If set to 0, the server won't automatically disqualify drivers and instead hand out “Stop&Go (30s)” penalties.\nThis way a server admin / race director has 3 laps time to review the incident, and either use “/dq” or “/clear” based on his judgement.",
  "shortFormationLap": "Toggles the short and long formation lap. Long formation is\nonly usable on private servers.",
  "dumpEntryList": "Will save an entry list at the end of any Qualifying session. This can be a quick way to collect a starting point to build an entry list, and is a way to save the defaultGridPositions which can be used to run a race without Qualifying session and predefined grid. Also see the corresponding admin command.",
  "track": "The track we run, see “Track name list”. Setting a wrong value will also print out the available track keys in the log.",
  "preRaceWaitingTimeSeconds": "Preparation time before a race. Cannot be less than 30s.",
  "sessionOverTimeSeconds": "Time after that a session is forcibly closing after the timer reached 0:00. Something like 107% of the expected laptime is recommended (careful: default 2 minutes does not properly cover tracks like Spa or Silverstone).",
  "ambientTemp": "Sets the baseline ambient temperature in °C, see  “Race weekend simulation”",
  "trackTemp": "Sets the starting track temperature, only useful for \n<hr/>\n<a name=6></a> \nweatherRandomness 0",
  "cloudLevel": "Sets the baseline cloud level, see “Race weekend simulation”. Values (0.0, 0.1, …. 1.0)",
  "rain": "Sets the baseline rain level, see  “Race weekend simulation”. Values (0.0, 0.1, …. 1.0). Values greater 0.1 may additionally override the cloud level",
  "weatherRandomness": "Sets the dynamic weather level, see  “Race weekend simulation”. \n0 = static weather; 1-3 fairly realistic weather; 4-7 more chaotic and sensational",
  "postQualySeconds": "The number of seconds the Qualifying result is displayed. Should not be set to 0, otherwise grid spawning is not secure.",
  "postRaceSeconds": "Additional time after the race ended for everyone, before the next race weekend starts",
  "sessions": "A list of session objects, see the next table",
  "hourOfDay": "Session starting hour of the day (values 0 - 23)",
  "dayOfWeekend": "Race weekend day: 1 = Friday, 2 = Saturday, 3 = Sunday; see  <a href=\"https://www.assettocorsa.net/forum/index.php?threads/the-server-admin-handbook-thread.58245/\">“ </a>\n<a href=\"https://www.assettocorsa.net/forum/index.php?threads/the-server-admin-handbook-thread.58245/\">Race weekend simulation”.</a>",
  "timeMultiplier": "Rate at which the session time advances in realtime.  Values 0, 1, … 24",
  "sessionType": "Race session type: P, Q, R for (P)ractice, (Q)ualy, (R)ace",
  "sessionDurationMinutes": "Session duration in minutes",
  "entries": "List of entries, see next table",
  "forceEntryList": "Will reject drivers that are not in the entry list. Default is 0, which allows the partial definition of entries in a “normal” server configuration. Cannot be used on public servers.",
  "drivers": "List of drivers, see next table. Must at least contain one driver with the SteamId",
  "raceNumber": "The preferred race number if set, -1 if the driver may decide by picking his car. Values 1 - 998",
  "forcedCarModel": "If not set to -1: user cannot join with a different car, see “Car model list” for the values",
  "overrideDriverInfo": "If set to 1, the driver’s name and category will be overridden by what is setup in the entry list. If set to 0, it’s up to the client joining.",
  "customCar": "If set to a filename, the car, team and appearance will be used no matter what the user chose (Exception: overrideCarModelForCustomCar). This is useful for leagues and events, where we want consistent car appearance and the chosen car model for the corresponding driver/team. The custom car file has to be located in a “cars” folder next to the entrylist.json (also works for centralEntryListPath). \nLeave blank (“”, =default) to let the user chose the car via car selection UI.",
  "overrideCarModelForCustomCar": "If customCar is used, this setting will apply the car model \nconfigured if the value is set to 1 (which is the default). If set to 0, all values except the carModel are applied, so the user is free to pick a car but while team name and appearance will be applied.",
  "isServerAdmin": "If set to 1, that user will be automatically elevated to server admin when he joins.",
  "firstName": "First name of the driver, if “overrideDriverInfo” is set to 1",
  "lastName": "Last name of the driver, if “overrideDriverInfo” is set to 1",
  "shortName": "Short name of the driver, if “overrideDriverInfo” is set to 1",
  "driverCategory": "Bronze/Silver/Gold/Platinum category, if “overrideDriverInfo” is set to 1. See <a href=\"https://www.assettocorsa.net/forum/index.php?threads/the-server-admin-handbook-thread.58245/\">“Driver Category list”</a> for values",
  "playerID": "Steam64 Id for this client; Add a “S” in the front"
}