{
    "adminPassword": "Password to elevate via \"Server admin commands\"",
    "allowAutoDQ": "If set to 0, the server won’t automatically disqualify drivers, and instead hand out Stop&amp;Go (30s) penalties. This way a server admin / race director has 3 laps time to review the incident, and either use /dq or /clear based on his judgement.",
    "ambientTemp": "Sets the baseline ambient temperature in °C, see  \"Race weekend simulation\" (ServerAdminHandbook)",
    "carGroup": "Defines the car group for this server. Possible values are &#34;FreeForAll&#34;, &#34;GT3&#34;, &#34;GT4&#34;, &#34;GTC&#34;, &#34;TCX&#34; where \"FreeForAll\" will allow any driver to join with any car (that he defined as Primary Car). GT3, GT4, GTC, TCX will restrict this server to GT3, GT4, Cup-like (Porsche Cup, Lamborghini ST, Ferrari CHL) and TCX (BMW M2) entries",
    "centralEntryListPath": "Can override the default entryList path \"cfg/entrylist.json\", so multiple ACC servers on the machine can use the same entrylist (and custom car files). Set a full path like \"C:/customEntryListSeriesA/\", where the entrylist is stored. Attention: The path seperators have to be slashes (/), backslashes (\\) will not work.",
    "cloudLevel": "Sets the baseline cloud level, see \"Race weekend simulation\" (ServerAdminHandbook). Has large impact on the cloud levels and rain chances.  Values (0.0, 0.1, …. 1.0)",
    "customCar": "If set to a filename, the car, team and appearance will be used no matter what the user chose (Exception: overrideCarModelForCustomCar). This is useful for leagues and events, where we want consistent car appearance and the chosen car model for the corresponding driver/team. The custom car file has to be located in a \"cars\" folder next to the entrylist.json (also works for centralEntryListPath). Leave blank (\"\", =default) to let the user chose the car via car selection UI.",
    "dayOfWeekend": "Race day (1 = Friday, 2 = Saturday, 3 = Sunday) – relevant to the grip and weather simulation.",
    "defaultGridPosition": "If set to a value of 1 or greater, this car will obtain this grid position if a race starts without any qualifying session <img src=\"ServerAdminHandbook-28_1.jpg\"/>",
    "disableAutoClutch": "Forces the equivalent assist option to \"off\"",
    "disableAutoEngineStart": "Forces the equivalent assist option to \"off\"",
    "disableAutoGear": "Forces the equivalent assist option to \"off\"",
    "disableAutoLights": "Forces the equivalent assist option to \"off\"",
    "disableAutoPitLimiter": "Forces the equivalent assist option to \"off\"",
    "disableAutoWiper": "Forces the equivalent assist option to \"off\"  ",
    "disableAutosteer": "Disables the steering aid that is only available for gamepad controllers. Unlike SC, this works inside the physics and does not allow unrealistic driving behaviour – except that this is a very strong aid with superhuman feeling for grip and high reaction speed. There is a built-in penalty that should balance the driving performance in most cases, and give an incentive to learn not to use the driving aid. Default: 0",
    "disableIdealLine": "Forces the equivalent assist option to \"off\"",
    "driverCategory": "Bronze/Silver/Gold/Platinum category, if \"overrideDriverInfo\" is set to 1. See \"Driver Category list\" (ServerAdminHandbook) for values",
    "driverStintTimeSec": "Defines the maximum time a driver can stay out without getting a penalty. Can be used to balance fuel efficient cars in endurance races. The stint time resets in the pitlane, no real stop is required.  -1 will disable the stint times. driverStintTimeSec and maxTotalDrivingTime are interdependent features, make sure both are set or off.",
    "drivers": "List of drivers, see table in ServerAdminHandbook. Must at least contain one driver with the SteamId",
    "dumpEntryList": "Will save an entry list at the end of any Qualifying session. This can be a quick way to collect a starting point to build an entry list, and is a way to save the defaultGridPositions which can be used to run a race without Qualifying session and predefined grid. Also see the corresponding admin command.",
    "dumpLeaderboards": "If set to 1, any session will write down the result leaderboard in a \"results\" folder (must be manually created). See \"Session results\" (ServerAdminHandbook)",
    "entries": "List of entries, see table in ServerAdminHandbook",
    "firstName": "First name of the driver, if \"overrideDriverInfo\" is set to 1",
    "forceEntryList": "Will reject drivers that are not in the entry list. Default is 0, which allows the partial definition of entries in a \"normal\" server configuration. Cannot be used on public servers.",
    "forcedCarModel": "If not set to -1: user cannot join with a different car, see \"Car model list\" (ServerAdminHandbook) for the values",
    "formationLapType": "Toggles the formation lap type that is permanently used on this server: 3 – default formation lap with position control and UI 0 – old limiter lap 1 – free (replaces /manual start), only usable for private servers",
    "hourOfDay": "Session starting hour of the day (values 0 - 23)",
    "ignorePrematureDisconnects": "Removes a (very good) fix where users can randomly lose the connection. There is no sane reason to turn this off. 1 – default: less arbitrary connections lost 0 – more timeouts, but strict disconnection of anyone who appears inactive for 5 seconds. Can be useful on unsupported platforms where TCP sockets act differently",
    "isFixedConditionQualification": "Experimental/not supported: if set to 1, the server will take the rain, cloud, temperature, rain levels literally and make sure whatever is set up never changes. Daytime transitions still happen visually, but do not affect the temperatures or road wetness. Also rubber/grip is always the same. This is intended to be used for private league qualification servers only. weatherRandomness has to be set to 0, otherwise isFixedConditionQualification will be completely disabled.",
    "isMandatoryPitstopRefuellingRequired": "Defines if a mandatory pitstop requires refuelling.",
    "isMandatoryPitstopSwapDriverRequired": "Defines if a mandatory pitstop requires a driver swap. Will only be effective for cars in driver swap situations; even in a mixed field this will be  skipped for cars with a team size of 1 driver.",
    "isMandatoryPitstopTyreChangeRequired": "Defines if a mandatory pitstop requires changing tyres.",
    "isRaceLocked": "If set to 0, the server will allow joining during a race session. Is not useful in \"Public Multiplayer\", as the user-server matching will ignore ongoing race sessions.",
    "isRefuellingAllowedInRace": "Defines if refuelling is allowed during the race pitstops.",
    "isRefuellingTimeFixed": "If set to true, any refuelling will take the same amount of time. If turned off, refuelling will consume time linear to the amount refuelled. Very useful setting to balance fuel efficient cars, especially if combined with other features.",
    "isServerAdmin": "If set to 1, that user will be automatically elevated to server admin when he joins.",
    "lanDiscovery": "Defines if the server will listen to LAN discovery requests. Can be turned off for dedicated servers.",
    "lastName": "Last name of the driver, if \"overrideDriverInfo\" is set to 1",
    "leagueServerIP": "Declares the server IP which will return ALL existing ACC servers on during a \"LAN Server\" search.",
    "mandatoryPitstopCount": "Defines the basic mandatory pit stops. If the value is greater zero, any car that did not execute the mandatory pitstops will be disqualified at the end of the race. The necessary actions can be further  configured using the \"isMandatoryPitstopXYRequired\" properties. A value of zero disables the feature.",
    "maxCarSlots": "Replaces \"maxClientsOverride\" and \"spectatorSlots\". Defines the amount of car slots the server can occupy; this value is overridden if the pit count of the track is lower, or with 30 for public MP. The gap between maxCarSlots and maxConnections defines how many spectators or other irregular connections (ie entry list entries) can be on the server.",
    "maxConnections": "Replaces \"maxClients\". The maximum amount of connections a server will accept at a time. If you own the hardware server, you can just set any high number you want. If you rented a 16 or 24 slot server, your Hosting Provider probably has set this here and doesn’t give you write-access to this configuration file.",
    "maxDriversCount": "In driver swap situations, set this to the maximum number of drivers on a car. When an entry has fewer drivers than maxDriversCount, maxTotalDrivingTime is automatically compensated so that those &#34;smaller&#34; entries are also able to complete the race Example: 3H race length, 65 minutes driverStintTimeSec and 65 minutes maxTotalDrivingTime will result in 65 minutes of maxTotalDrivingTime for entries of 3 and 105 (!) minutes for entries of 2.",
    "maxTotalDrivingTime": "Restricts the maximum driving time for a single driver. Is only useful for driver swap situations and allows to enforce a minimum driving time for each driver (IRL this is used to make sure mixed teams like Pro/Am have a fair distributions of the slower drivers). -1 disables the feature. driverStintTimeSec and maxTotalDrivingTime are interdependent features, make sure both are set or off. Will set the maximum driving time for the team size defined by \"maxDriversCount\", always make sure both are set.",
    "metaData": "A user defined string that will be transferred to the result outputs.",
    "overrideCarModelForCustomCar": "If customCar is used, this setting will apply the car model configured if the value is set to 1 (which is the default). If set to 0, all values except the carModel are applied, so the user is free to pick a car but while team name and appearance will be applied.",
    "overrideDriverInfo": "If set to 1, the driver’s name and category will be overridden by what is setup in the entry list. If set to 0, it’s up to the client joining.",
    "password": "Password required to enter this server. If a password is set, the server is declared \"Private Multiplayer\".",
    "pitWindowLengthSec": "Defines a pit window at the middle of the race. Obviously covers the Sprint series format. -1 will disable the pit window. Use this combined with a mandatoryPitstopCount = 1.",
    "playerID": "Steam64 Id for this client; Add a \"S\" in the front",
    "postQualySeconds": "The time after the last driver is finished (or the sessionOverTimeSeconds passed) in Q sessions and the race start.  Should not be set to 0, otherwise grid spawning is not secure.",
    "postRaceSeconds": "Additional time after the race ended for everyone, before the next race weekend starts.",
    "preRaceWaitingTimeSeconds": "Preparation time before a race. Cannot be less than 30s.",
    "publicIP": "Explicitly defines the public IP address this server is listening to. Useful if the backend is connected via a different gateway (for example the AWS Accelerator IP). If the publicIP is used, the server has to respond to an additional handshake, or it will immediately shutdown on backend connect.",
    "qualifyStandingType": "1 = fastest lap, 2 = average lap (running Endurance mode for multiple Q sessions) . Use 1, averaging Qualy is not yet officially supported.",
    "raceNumber": "The preferred race number if set, -1 if the driver may decide by picking his car. Values 1 - 998",
    "racecraftRatingRequirement": "Defines the Racecraft Rating (RC) that a user must have to join this server (values -1, 0, …. 99)",
    "rain": "If weather randomness is off, defines the static rain level. With dynamic weather, it defines the expected rain level, dependent on weatherRandomness.  Values (0.0, 0.1, …. 1.0) ",
    "randomizeTrackWhenEmpty": "If set to 1, the server will change to a random track when the last drivers leaves (which causes a reset to FP1). The \"track\"  property will only define the default state for the first session.",
    "registerToLobby": "When 0, this server won’t register to the backend. Is useful for LAN sessions. If 0, the server is declared \"Private Multiplayer\". See serverList.json to learn how to bypass the backend’s server list and discover servers not listed.",
    "safetyRatingRequirement": "Defines the Safety Rating (SA) that a user must have to join this server (values -1, 0, …. 99)",
    "serverName": "The server name displayed in the ACC UI pages",
    "sessionDurationMinutes": "Session duration in minutes",
    "sessionOverTimeSeconds": "Time after that a session is forcibly closing after the timer reached 0:00. Something like 107% of the expected laptime is recommended (careful: default 2 minutes does not properly cover tracks like Spa or Silverstone).",
    "sessionType": "Race session type: P, Q, R for (P)ractice, (Q)ualy, (R)ace",
    "sessions": "A list of session objects, see table in ServerAdminHandbook",
    "shortFormationLap": "Toggles the short and long formation lap. Long formation is only usable on private servers.",
    "shortName": "Short name of the driver, if \"overrideDriverInfo\" is set to 1",
    "simracerWeatherConditions": "Experimental/not supported: if set to 1, this will limit the maximum rain/wetness to roughly 2/3 of the maximum values, translating to something between medium and heavy rain. It may be useful if you feel forced to run very low cloudLevel and weatherRandomness values just to avoid thunderstorm; however high levels (0.4+ clouds combined with 5+ randomness) will still result in quite serious conditions.",
    "spectatorPassword": "Password to enter the server as spectator. Must be different to \"password\" if both is set.",
    "stabilityControlLevelMax": "Set’s the maximum % of SC that can be used. In case a client has a higher SC set than allowed by the server, he will only run what is allowed (25% in this example). Obviously setting this property to 0 removes all SC, including mouse and keyboard users. The Stability Control is an artificial driving aid that allows the car to act out of the physics boundaries, and highly recommended to overcome input methods like Keyboards, Gamepads and Mouse steering. However, there is a built-in effect that makes the SC performance inferior, so in theory using (and relying) on SC is already more than enough penalty, and the way to improve performance is to practice driving without. Default: 100",
    "tcpPort": "ACC clients will use this port to establish a connection to the server",
    "timeMultiplier": "Rate at which the session time advances in realtime.  Values 0, 1, … 24 ",
    "track": "The track we run, see \"Track name list\". Setting a wrong value will also print out the available track keys in the log",
    "trackMedalsRequirement": "Defines the amount of track medals that a user has to have for the given track (values 0, 1, 2, 3)",
    "trackTemp": "Obsolete: Track temperatures are always simulated based on ambient temperature, sun angle, clouds and other aspects.",
    "tyreSetCount": "Experimental/not supported: Can be used to reduce the amount of tyre sets any car entry has for the entire weekend. Please note that it is necessary to force cars to remain in the server, or drastically reduced tyre sets will be ineffective, as rejoining will reset the tyre sets.",
    "udpPort": "Connected clients will use this Port to stream the car positions and is used for the ping test. In case you never see your server getting a ping value, this indicates that the udpPort is not accessible",
    "weatherRandomness": "Sets the dynamic weather level, see  \"Race weekend simulation\" (ServerAdminHandbook). 0 = static weather; 1-4 fairly realistic weather; 5-7 more sensational"
}
